import pandas as pd
from efficient_apriori import apriori

data = pd.read_csv('订单表.csv', encoding='gbk')
test = pd.pivot_table(data, index=['客户ID', '产品名称']).to_csv("temp.csv")
data2 = pd.read_csv('temp.csv')[['客户ID', '产品名称']]
transactions = []
print(data2.shape[0])
print(data2.values[1,1])
temp = []
for i in range(0, data2.shape[0]-1):

    if data2.values[i+1,0]==data2.values[i,0]:

        temp.append(str(data2.values[i, 1]))
    else:
        print(i)
        if temp != []:
            transactions.append(temp)
        temp = []
print(transactions)
itemsets, rules = apriori(transactions, min_support=0.02,  min_confidence=0.4)
print("频繁项集：", itemsets)
print("关联规则：", rules)

#频繁项集： {1: {('挡泥板',): 1593, ('旅行自行车',): 1483, ('头盔',): 5279, ('车胎和内胎',): 1150, ('山地自行车',): 3485, ('公路自行车',): 5519, ('水壶和水壶架',): 1963, ('帽子',): 1956, ('手套',): 1259, ('挂架',): 289, ('短裤',): 534, ('袜子',): 282, ('清洁剂',): 552, ('水袋背包',): 422}, 2: {('头盔', '山地自行车'): 1233, ('头盔', '挡泥板'): 499, ('头盔', '旅行自行车'): 630, ('头盔', '车胎和内胎'): 551, ('山地自行车', '挡泥板'): 646, ('山地自行车', '旅行自行车'): 993, ('公路自行车', '头盔'): 1409, ('公路自行车', '山地自行车'): 1786, ('公路自行车', '帽子'): 555, ('公路自行车', '挡泥板'): 341, ('公路自行车', '水壶和水壶架'): 565, ('头盔', '帽子'): 608, ('头盔', '水壶和水壶架'): 581, ('山地自行车', '帽子'): 476, ('山地自行车', '水壶和水壶架'): 556, ('帽子', '水壶和水壶架'): 310, ('挡泥板', '水壶和水壶架'): 328, ('旅行自行车', '水壶和水壶架'): 379, ('头盔', '手套'): 601, ('帽子', '车胎和内胎'): 290, ('公路自行车', '手套'): 310, ('公路自行车', '旅行自行车'): 411}, 3: {('头盔', '山地自行车', '旅行自行车'): 513, ('公路自行车', '头盔', '山地自行车'): 614, ('公路自行车', '山地自行车', '挡泥板'): 341, ('山地自行车', '旅行自行车', '水壶和水壶架'): 315, ('公路自行车', '山地自行车', '旅行自行车'): 308}}
#关联规则： [{旅行自行车} -> {头盔}, {车胎和内胎} -> {头盔}, {挡泥板} -> {山地自行车}, {旅行自行车} -> {山地自行车}, {山地自行车} -> {公路自行车}, {手套} -> {头盔}, {山地自行车, 旅行自行车} -> {头盔}, {头盔, 旅行自行车} -> {山地自行车}, {头盔, 山地自行车} -> {旅行自行车}, {头盔, 山地自行车} -> {公路自行车}, {公路自行车, 头盔} -> {山地自行车}, {山地自行车, 挡泥板} -> {公路自行车}, {公路自行车, 挡泥板} -> {山地自行车}, {旅行自行车, 水壶和水壶架} -> {山地自行车}, {山地自行车, 水壶和水壶架} -> {旅行自行车}, {公路自行车, 旅行自行车} -> {山地自行车}]
